controllers/OutputController.php

    public function actionCreate()
    {
        $request = Yii::$app->request;
        $model = new Output();

        if($request->isAjax){
            /*
            *   Process for ajax request
            */
            Yii::$app->response->format = Response::FORMAT_JSON;
            if($request->isGet){
                return [
                    'title'=> "Create new Output",
                    'content'=>$this->renderAjax('create', [
                        'model' => $model,
                    ]),
                    'footer'=> Html::button('Close',['class'=>'btn btn-default pull-left','data-dismiss'=>"modal"]).
                                Html::button('Save',['class'=>'btn btn-primary','type'=>"submit"])

                ];
            }else if($model->load($request->post()) && $model->save()){
---
INSERT INTO "output" ("customer_id", "book_id", "issue_date", "user_id", "created_at") VALUES (2, 2, NULL, 1, '2021-02-27 18:04:45') RETURNING "id"