controllers/ReceptionController.php

INSERT INTO "reception" ("book_id", "state", "customer_id", "user_id", "created_at") VALUES (2, 'Удовлетворительное', 1, 1, '2021-02-27 18:08:02') RETURNING "id"
---
    public function actionCreate()
    {
        $request = Yii::$app->request;
        $model = new Reception();

        if($request->isAjax){
            /*
            *   Process for ajax request
            */
            Yii::$app->response->format = Response::FORMAT_JSON;
            if($request->isGet){
                return [
                    'title'=> "Create new Reception",
                    'content'=>$this->renderAjax('create', [
                        'model' => $model,
                    ]),
                    'footer'=> Html::button('Close',['class'=>'btn btn-default pull-left','data-dismiss'=>"modal"]).
                                Html::button('Save',['class'=>'btn btn-primary','type'=>"submit"])

                ];
            }else if($model->load($request->post()) && $model->save()){