models/Output.php

UPDATE "book" SET "status"=1 WHERE "id"=2
UPDATE "customer" SET "book_count"=2 WHERE "id"=2
---
    public function beforeSave($insert)
    {
        if($this->isNewRecord){
            $book = Book::find()->where(['id' => $this->book_id])->one();
            $book->status = 1;
            $book->save();
            $customer = Customer::find()->where(['id' => $this->customer_id])->one();
            $customer->book_count += 1;
            $customer->save();