models/Reception.php

    public function beforeSave($insert)
    {
        if($this->isNewRecord){
            $out = Output::find()->where(['book_id' => $this->book_id])->orderBy(['id'=>SORT_DESC])->one();
            $this->customer_id = $out->customer_id;

            $customer = Customer::find()->where(['id' => $this->customer_id])->one();
            $customer->book_count -= 1;
            $customer->save();

            $book = Book::find()->where(['id' => $this->book_id])->one();
            $book->status = 0;
            $book->save();
---
UPDATE "customer" SET "book_count"=-1 WHERE "id"=1
UPDATE "book" SET "status"=0 WHERE "id"=2